app/controllers/devise/registrations_controller.rb

  def new
    @users = User.all.order(:firstname, :lastname)
    @alert_messages = params[:alert_messages]
  	@profiles = Profile.where("published IS NOT FALSE")
---
SELECT "users".* FROM "users" ORDER BY "users".firstname ASC, "users".lastname ASC
SELECT "profiles".* FROM "profiles" WHERE (published IS NOT FALSE)