app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE (name NOT IN ('Administrateur', 'Audit-Contrôle', 'Audit')) LIMIT 17 OFFSET 0
---
  def index
    @namecss = @shortcutcss = "row-form"
    @profiles = Profile.where("shortcut NOT IN ('ADMIN-P', 'ADMIN-R', 'ADMIN-A', 'GBUM')").order("name ASC").page(params[:page]).per_page(17)

SELECT "profiles".* FROM "profiles" WHERE (name NOT IN ('Administrateur', 'Audit-Contrôle', 'Audit')) LIMIT 17 OFFSET 0
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "profiles" ("created_at", "name", "shortcut", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 27 May 2014 16:59:49 UTC +00:00], ["name", "Duke"], ["shortcut", "DUK"], ["updated_at", Tue, 27 May 2014 16:59:49 UTC +00:00]]
---
  def create
    @error_messages = []
    @success_messages = []
    @namecss = @shortcutcss = "row-form"
    @name = params[:name]
    @shortcut = params[:shortcut]
    @profiles = Profile.where("shortcut NOT IN ('ADMIN-P', 'ADMIN-R', 'ADMIN-A', 'GBUM')").page(params[:page]).per_page(17)

    if Profile.find(:all, :conditions => ["name ILIKE ? OR shortcut ILIKE ?", @name, @shortcut]).blank?
      @fields = [[@name, "le nom du profil", "@namecss"], [@shortcut, "l'abbréviation du profil", "@shortcutcss"]]

      @fields.each do |field|
        if field[0].blank?
          @error_messages << "Veuillez entrer #{field[1]}."
          my_container = field[2]
          instance_variable_set("#{my_container}", "row-form error")
          @error = true
        end
      end

      unless @error
        Profile.create(name: @name, shortcut: @shortcut.upcase)

SELECT "profiles".* FROM "profiles" WHERE (name NOT IN ('Administrateur', 'Audit-Contrôle', 'Audit')) LIMIT 17 OFFSET 0
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit
    @namecss = @shortcutcss = "row-form"
     @profiles = Profile.where("shortcut NOT IN ('ADMIN-P', 'ADMIN-R', 'ADMIN-A', 'GBUM')").page(params[:page]).per_page(17)
    @profile = Profile.find_by_id(params[:id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 ORDER BY "profiles"."id" ASC LIMIT 1  [["id", 1]]
SELECT "profiles".* FROM "profiles" WHERE (name NOT IN ('Administrateur', 'Audit-Contrôle', 'Audit')) LIMIT 17 OFFSET 0
UPDATE "profiles" SET "name" = 'Duke', "shortcut" = 'DUK' WHERE "profiles"."id" = 4
---
  def update
    @error_messages = []
    @success_messages = []
    @namecss = @shortcutcss = "row-form"
    @profile = Profile.find_by_id(params[:id])
    @name = params[:name]
    @shortcut = params[:shortcut]
    @profiles = Profile.where("shortcut NOT IN ('ADMIN-P', 'ADMIN-R', 'ADMIN-A', 'GBUM')").page(params[:page]).per_page(17)

    if Profile.find(:all, :conditions => ["(name ILIKE ? OR shortcut ILIKE ?) AND id != ?", @name, @shortcut, @profile.id]).blank?
      @fields = [[@name, "le nom du profil", "@namecss"], [@shortcut, "l'abbréviation du profil", "@shortcutcss"]]

      @fields.each do |field|
        if field[0].blank?
          @error_messages << "Veuillez entrer #{field[1]}."
          my_container = field[2]
          instance_variable_set("#{my_container}", "row-form error")
          @error = true
        end
      end

      unless @error
        @profile.update_columns(name: @name, shortcut: @shortcut.upcase)

SELECT "profiles".* FROM "profiles" WHERE (name NOT IN ('Administrateur', 'Audit-Contrôle', 'Audit')) LIMIT 17 OFFSET 0
---
  def edit_rights
    @profiles = Profile.where("shortcut NOT IN ('ADMIN-P', 'ADMIN-R', 'ADMIN-A', 'GBUM')").order("name ASC").page(params[:page]).per_page(17)